app/controllers/admin_controller.rb

  def reset
    if request.method == :put
      @user = User.find(params[:id])

      respond_to do |format|
        if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-05-06 15:36:46', "encrypted_password" = '9aa4732bdff9771a15643029fbe41e10c658425a', "password_salt" = 'pQLObtFIJ82NxEB-o1ZC' WHERE "id" = 4

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-05-07 14:29:45', "username" = 'testtest' WHERE "id" = 2