app/controllers/card_sets_controller.rb

SELECT * FROM "card_sets" ORDER BY name
---
  def index
    @card_sets = CardSet.all( :order => "name" )

SELECT * FROM "card_sets" WHERE ("card_sets"."id" = 1)
---
  def show
    @card_set = CardSet.find(params[:id])

SELECT * FROM "card_sets" WHERE ("card_sets"."id" = 3)
---
  def edit
    @card_set = CardSet.find(params[:id])

INSERT INTO "card_sets" ("name", "created_at", "comments", "set_type", "updated_at") VALUES('Dominion: Seaside', '2010-05-04 17:30:47', 'The second Dominion expansion. Seaside was release in 2009.', 'Expansion', '2010-05-04 17:30:47')
INSERT INTO "cards" ("game", "name", "created_at", "card_type", "cost", "updated_at", "expansion", "card_text") VALUES('Dominion', 'Native Village', '2010-05-04 17:30:47', 'Action', '2', '2010-05-04 17:30:47', 'Seaside', 'Choose one: Set aside the top card of your deck face down on your Native Village mat; or put all the cards from your mat into your hand. You may look at the cards on your mat at any time; return them to your deck at the end of the game.')
---
  def create
    @card_set = CardSet.new(params[:card_set])

    respond_to do |format|
      if @card_set.save

SELECT * FROM "card_sets" WHERE ("card_sets"."id" = 3)
UPDATE "card_sets" SET "updated_at" = '2010-05-04 23:03:50', "comments" = 'The original. Domininon was released in 2008.' WHERE "id" = 3
---
  def update
    params[:card_set][:card_ids] ||= []
    @card_set = CardSet.find(params[:id])

    respond_to do |format|
      if @card_set.update_attributes(params[:card_set])

SELECT * FROM "card_sets" WHERE ("card_sets"."id" = 9)
DELETE FROM "card_sets" WHERE "id" = 9
---
  def destroy
    @card_set = CardSet.find(params[:id])
    @card_set.destroy