app/controllers/cards_controller.rb

  def index
    @game = params[:game] ||= ""
    @cards = Card.all( :order => "game, expansion, name" )
---
SELECT * FROM "cards" ORDER BY game, expansion, name

  def show
    @game = params[:game] ||= ""
    @card = Card.find(params[:id])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)

  def edit
    @game = params[:game] ||= ""
    @card = Card.find(params[:id])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)

  def create
    @game = params[:game] ||= ""
    @card = Card.new(params[:card])
    @card.creator = current_user

    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("game", "name", "created_at", "card_type", "cost", "updated_at", "expansion", "card_text") VALUES('Dominion', 'test', '2010-05-06 21:47:31', 'test', '3', '2010-05-06 21:47:31', 'test', 'test test teset')

  def update
    @game = params[:game] ||= ""
    @card = Card.find(params[:id])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)

  def destroy
    @game = params[:game] ||= ""
    @card = Card.find(params[:id])
    @card.destroy
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)
DELETE FROM "cards" WHERE "id" = 1